app/controllers/posts_controller.rb

INSERT INTO "posts" ("caption", "created_at", "updated_at", "posted_image_id") VALUES (?, ?, ?, ?)  [["caption", "Ccc"], ["created_at", "2018-03-23 08:58:04.962337"], ["updated_at", "2018-03-23 08:58:04.962337"], ["posted_image_id", "b465a4fe8d42c1704eb5b089ee708c2f521c6d9d09a96f8aaee8a5fa4fde"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save